<?php

return [
    'name' => 'مستورد المواقع',
    'imported_successfully' => 'تم استيراد مواقعك بنجاح!',
    'choose_country' => 'اختر البلد...',
    'import_failed_description' => 'فشل الاستيراد، يرجى التحقق من الأخطاء أدناه!',
    'available_enable_multi_language' => 'متاح فقط عندما تقوم بتمكين "هل هو متعدد اللغات؟"',
    'import_available_data_help' => "البلدان مستبعدة من القائمة لأنها موجودة بالفعل في النظام. لإعادة استيراد أي منها، احذفها من :link وحاول مرة أخرى.",
    'import_available_data' => 'استيراد البيانات المتاحة',
    'available_data_help' => 'يتم الحصول على بيانات المواقع من مستودع GitHub الخاص بنا في :link. للمساهمة وانعكاس تحديثاتك هنا، يرجى تقديم طلب سحب.',
    'import' => 'استيراد',
    'upload_file_placeholder' => 'اسحب وأفلت الملف هنا أو انقر للرفع',
    'skip_existing_records' => 'تخطي السجلات الموجودة',
    'skip_existing_records_description' => 'سيتحقق من وجود البلد أو الولاية أو المدينة في قاعدة البيانات بالاسم ويتخطى استيراد أي سجلات موجودة بالفعل.',
    'cant_download_location_at_this_time' => 'لا يمكننا تنزيل الموقع في هذا الوقت. يرجى المحاولة مرة أخرى لاحقاً.',
];