<?php

return [
    'name' => 'المدن',
    'description' => 'إدارة مدن المواقع',
    'create' => 'مدينة جديدة',
    'state' => 'الولاية',
    'select_state' => 'اختر الولاية...',
    'select_city' => 'اختر المدينة...',
    'country' => 'البلد',
    'select_country' => 'اختر البلد...',
    'city' => 'المدينة',
    'zip_code' => 'الرمز البريدي',
    'zip_code_helper' => 'التنسيق الأساسي للرمز البريدي هو خمسة أرقام. على سبيل المثال، في الولايات المتحدة، 00501 هو مثال على رمز بريدي فريد لخدمة الإيرادات الداخلية في هولتسفيل، نيويورك.',
];