<?php

return [
    'login' => [
        'username' => 'البريد الإلكتروني/اسم المستخدم',
        'email' => 'البريد الإلكتروني',
        'password' => 'كلمة المرور',
        'title' => 'تسجيل دخول المستخدم',
        'remember' => 'تذكرني؟',
        'login' => 'تسجيل الدخول',
        'placeholder' => [
            'username' => 'أدخل اسم المستخدم أو عنوان البريد الإلكتروني',
            'email' => 'أدخل عنوان البريد الإلكتروني',
            'password' => 'أدخل كلمة المرور',
        ],
        'success' => 'تم تسجيل الدخول بنجاح!',
        'fail' => 'اسم المستخدم أو كلمة المرور خاطئة.',
        'not_active' => 'لم يتم تفعيل حسابك بعد!',
        'banned' => 'هذا الحساب محظور.',
        'logout_success' => 'تم تسجيل الخروج بنجاح!',
        'dont_have_account' => 'ليس لديك حساب في هذا النظام، يرجى الاتصال بالمشرف للحصول على مزيد من المعلومات!',
    ],
    'forgot_password' => [
        'title' => 'نسيت كلمة المرور',
        'message' => '<p>هل نسيت كلمة المرور؟</p><p>يرجى إدخال حساب البريد الإلكتروني الخاص بك. سيرسل النظام بريداً إلكترونياً يحتوي على رابط تفعيل لإعادة تعيين كلمة المرور.</p>',
        'submit' => 'إرسال',
    ],
    'reset' => [
        'new_password' => 'كلمة المرور الجديدة',
        'password_confirmation' => 'تأكيد كلمة المرور الجديدة',
        'email' => 'البريد الإلكتروني',
        'title' => 'إعادة تعيين كلمة المرور',
        'update' => 'تحديث',
        'wrong_token' => 'هذا الرابط غير صالح أو منتهي الصلاحية. يرجى المحاولة مرة أخرى باستخدام نموذج إعادة التعيين.',
        'user_not_found' => 'اسم المستخدم هذا غير موجود.',
        'success' => 'تم إعادة تعيين كلمة المرور بنجاح!',
        'fail' => 'الرمز غير صالح، رابط إعادة تعيين كلمة المرور منتهي الصلاحية!',
        'reset' => [
            'title' => 'بريد إلكتروني لإعادة تعيين كلمة المرور',
        ],
        'send' => [
            'success' => 'تم إرسال بريد إلكتروني إلى حساب البريد الإلكتروني الخاص بك. يرجى التحقق وإكمال هذا الإجراء.',
            'fail' => 'لا يمكن إرسال البريد الإلكتروني في هذا الوقت. يرجى المحاولة مرة أخرى لاحقاً.',
        ],
        'new-password' => 'كلمة المرور الجديدة',
        'placeholder' => [
            'new_password' => 'أدخل كلمة المرور الجديدة',
            'new_password_confirmation' => 'أكد كلمة المرور الجديدة',
        ],
    ],
    'email' => [
        'reminder' => [
            'title' => 'بريد إلكتروني لإعادة تعيين كلمة المرور',
        ],
    ],
    'password_confirmation' => 'تأكيد كلمة المرور',
    'failed' => 'فشل',
    'throttle' => 'تقييد',
    'not_member' => 'لست عضواً بعد؟',
    'register_now' => 'سجل الآن',
    'lost_your_password' => 'فقدت كلمة المرور؟',
    'login_title' => 'المشرف',
    'login_via_social' => 'تسجيل الدخول عبر الشبكات الاجتماعية',
    'back_to_login' => 'العودة إلى صفحة تسجيل الدخول',
    'sign_in_below' => 'سجل الدخول أدناه',
    'languages' => 'اللغات',
    'reset_password' => 'إعادة تعيين كلمة المرور',
    'deactivated_message' => 'تم إلغاء تفعيل حسابك. يرجى الاتصال بالمشرف.',
    'settings' => [
        'email' => [
            'title' => 'ACL',
            'description' => 'تكوين بريد ACL الإلكتروني',
            'templates' => [
                'password_reminder' => [
                    'title' => 'إعادة تعيين كلمة المرور',
                    'description' => 'إرسال بريد إلكتروني للمستخدم عند طلب إعادة تعيين كلمة المرور',
                    'subject' => 'إعادة تعيين كلمة المرور',
                    'reset_link' => 'رابط إعادة تعيين كلمة المرور',
                    'email_title' => 'تعليمات إعادة تعيين كلمة المرور',
                    'email_message' => 'تتلقى هذا البريد الإلكتروني لأننا تلقينا طلب إعادة تعيين كلمة المرور لحسابك.',
                    'button_text' => 'إعادة تعيين كلمة المرور',
                    'trouble_text' => 'إذا كنت تواجه مشكلة في النقر على زر "إعادة تعيين كلمة المرور"، انسخ والصق الرابط أدناه في متصفح الويب الخاص بك: <a href=":reset_link">:reset_link</a> والصقه في متصفحك. إذا لم تطلب إعادة تعيين كلمة المرور، يرجى تجاهل هذه الرسالة أو الاتصال بنا إذا كان لديك أي أسئلة.',
                ],
            ],
        ],
    ],
];