<?php

return [
    'settings' => [
        'title' => 'التحسين السريع',
        'description' => 'تصغير مخرجات HTML، تضمين CSS، إزالة التعليقات...',
        'enable' => 'تفعيل تحسين سرعة الصفحة؟',
    ],
    'collapse_white_space' => 'طي المساحات البيضاء',
    'collapse_white_space_description' => 'يقلل هذا المرشح من البايتات المنقولة في ملف HTML عن طريق إزالة المساحات البيضاء غير الضرورية.',
    'elide_attributes' => 'حذف الخصائص',
    'elide_attributes_description' => 'يقلل هذا المرشح من حجم نقل ملفات HTML عن طريق إزالة الخصائص من العلامات عندما تكون القيمة المحددة مساوية للقيمة الافتراضية لتلك الخاصية. يمكن أن يوفر هذا عددًا متواضعًا من البايتات، وقد يجعل المستند أكثر قابلية للضغط من خلال توحيد العلامات المتأثرة.',
    'inline_css' => 'تضمين CSS',
    'inline_css_description' => 'يحول هذا المرشح خاصية "style" المضمنة للعلامات إلى فئات عن طريق نقل CSS إلى الرأس.',
    'insert_dns_prefetch' => 'إدراج DNS prefetch',
    'insert_dns_prefetch_description' => 'يحقن هذا المرشح علامات في HEAD لتمكين المتصفح من القيام بـ DNS prefetching.',
    'remove_comments' => 'إزالة التعليقات',
    'remove_comments_description' => 'يزيل هذا المرشح تعليقات HTML و JS و CSS. يقلل المرشح من حجم نقل ملفات HTML عن طريق إزالة التعليقات. اعتمادًا على ملف HTML، يمكن لهذا المرشح أن يقلل بشكل كبير من عدد البايتات المنقولة على الشبكة.',
    'remove_quotes' => 'إزالة علامات الاقتباس',
    'remove_quotes_description' => 'يزيل هذا المرشح علامات الاقتباس غير الضرورية من خصائص HTML. بينما مطلوبة من قبل مواصفات HTML المختلفة، تسمح المتصفحات بحذفها عندما تتكون قيمة الخاصية من مجموعة فرعية معينة من الأحرف (الأحرف الأبجدية الرقمية وبعض أحرف الترقيم).',
    'defer_javascript' => 'تأجيل JavaScript',
    'defer_javascript_description' => 'يؤجل تنفيذ javascript في HTML. إذا لزم الأمر إلغاء التأجيل في بعض النصوص، استخدم data-pagespeed-no-defer كخاصية نص لإلغاء التأجيل.',
];