<?php

return [
    '401_title' => 'الإذن مرفوض',
    '404_title' => 'لا يمكن العثور على الصفحة',
    '500_title' => 'لا يمكن تحميل الصفحة',
    'reasons' => 'قد يحدث هذا لعدة أسباب',
    'try_again' => 'يرجى المحاولة مرة أخرى خلال بضع دقائق، أو العودة إلى الصفحة الرئيسية عن طريق <a href=":link">النقر هنا</a>.',
    'not_found' => 'غير موجود',
    'results_not_found' => 'لم يتم العثور على نتائج!',
    'go_to_home' => 'الذهاب للرئيسية',
    'error_when_sending_email' => 'غير قادر على إرسال البريد الإلكتروني. يوجد خطأ في إعدادات البريد الإلكتروني في المشرف ← الإعدادات ← البريد الإلكتروني، يرجى التحقق من إعداداتك مرة أخرى.',
    'error_when_sending_email_guest' => 'غير قادر على إرسال البريد الإلكتروني. يرجى الاتصال بمدير الموقع إذا استمرت المشكلة.',
    'token_mismatch' => 'انتهت صلاحية الجلسة. يرجى المحاولة مرة أخرى.',
];